###################################################################

# Created by write_sdc on Mon Jun  2 20:03:35 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current A
set_max_area 0
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports GND]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports VDD]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G0]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G1]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G10]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G11]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G12]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G13]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G14]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G15]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G16]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G2]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G3]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G4]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G5]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G6]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G7]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G8]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G9]
set_fanout_load 2 [get_ports G701BF]
set_fanout_load 2 [get_ports G702]
set_fanout_load 2 [get_ports G726]
set_fanout_load 2 [get_ports G727]
set_fanout_load 2 [get_ports G729]
set_load -pin_load 0.1 [get_ports G701BF]
set_load -pin_load 0.1 [get_ports G702]
set_load -pin_load 0.1 [get_ports G726]
set_load -pin_load 0.1 [get_ports G727]
set_load -pin_load 0.1 [get_ports G729]
set_max_fanout 8 [get_ports GND]
set_max_fanout 8 [get_ports VDD]
set_max_fanout 8 [get_ports CK]
set_max_fanout 8 [get_ports G0]
set_max_fanout 8 [get_ports G1]
set_max_fanout 8 [get_ports G10]
set_max_fanout 8 [get_ports G11]
set_max_fanout 8 [get_ports G12]
set_max_fanout 8 [get_ports G13]
set_max_fanout 8 [get_ports G14]
set_max_fanout 8 [get_ports G15]
set_max_fanout 8 [get_ports G16]
set_max_fanout 8 [get_ports G2]
set_max_fanout 8 [get_ports G3]
set_max_fanout 8 [get_ports G4]
set_max_fanout 8 [get_ports G5]
set_max_fanout 8 [get_ports G6]
set_max_fanout 8 [get_ports G7]
set_max_fanout 8 [get_ports G8]
set_max_fanout 8 [get_ports G9]
create_clock [get_ports CK]  -period 5.5  -waveform {0 2.75}
set_clock_latency 2  [get_clocks CK]
set_input_delay -clock CK  2  [get_ports GND]
set_input_delay -clock CK  2  [get_ports VDD]
set_input_delay -clock CK  2  [get_ports G0]
set_input_delay -clock CK  2  [get_ports G1]
set_input_delay -clock CK  2  [get_ports G10]
set_input_delay -clock CK  2  [get_ports G11]
set_input_delay -clock CK  2  [get_ports G12]
set_input_delay -clock CK  2  [get_ports G13]
set_input_delay -clock CK  2  [get_ports G14]
set_input_delay -clock CK  2  [get_ports G15]
set_input_delay -clock CK  2  [get_ports G16]
set_input_delay -clock CK  2  [get_ports G2]
set_input_delay -clock CK  2  [get_ports G3]
set_input_delay -clock CK  2  [get_ports G4]
set_input_delay -clock CK  2  [get_ports G5]
set_input_delay -clock CK  2  [get_ports G6]
set_input_delay -clock CK  2  [get_ports G7]
set_input_delay -clock CK  2  [get_ports G8]
set_input_delay -clock CK  2  [get_ports G9]
set_output_delay -clock CK  2  [get_ports G701BF]
set_output_delay -clock CK  2  [get_ports G702]
set_output_delay -clock CK  2  [get_ports G726]
set_output_delay -clock CK  2  [get_ports G727]
set_output_delay -clock CK  2  [get_ports G729]
