###################################################################

# Created by write_sdc on Mon Jun  2 16:06:56 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current A
set_max_area 0
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G1]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G10]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G11]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G12]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G13]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G14]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G15]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G16]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G17]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G18]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G19]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G2]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G20]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G21]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G22]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G23]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G24]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G25]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G26]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G27]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G28]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G29]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G3]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G30]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G31]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G32]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G33]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G34]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G35]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G36]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G37]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G38]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G39]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G4]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G40]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G41]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G5]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G6]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G7]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G8]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports G9]
set_fanout_load 8 [get_ports G1324]
set_fanout_load 8 [get_ports G1325]
set_fanout_load 8 [get_ports G1326]
set_fanout_load 8 [get_ports G1327]
set_fanout_load 8 [get_ports G1328]
set_fanout_load 8 [get_ports G1329]
set_fanout_load 8 [get_ports G1330]
set_fanout_load 8 [get_ports G1331]
set_fanout_load 8 [get_ports G1332]
set_fanout_load 8 [get_ports G1333]
set_fanout_load 8 [get_ports G1334]
set_fanout_load 8 [get_ports G1335]
set_fanout_load 8 [get_ports G1336]
set_fanout_load 8 [get_ports G1337]
set_fanout_load 8 [get_ports G1338]
set_fanout_load 8 [get_ports G1339]
set_fanout_load 8 [get_ports G1340]
set_fanout_load 8 [get_ports G1341]
set_fanout_load 8 [get_ports G1342]
set_fanout_load 8 [get_ports G1343]
set_fanout_load 8 [get_ports G1344]
set_fanout_load 8 [get_ports G1345]
set_fanout_load 8 [get_ports G1346]
set_fanout_load 8 [get_ports G1347]
set_fanout_load 8 [get_ports G1348]
set_fanout_load 8 [get_ports G1349]
set_fanout_load 8 [get_ports G1350]
set_fanout_load 8 [get_ports G1351]
set_fanout_load 8 [get_ports G1352]
set_fanout_load 8 [get_ports G1353]
set_fanout_load 8 [get_ports G1354]
set_fanout_load 8 [get_ports G1355]
set_load -pin_load 0.1 [get_ports G1324]
set_load -pin_load 0.1 [get_ports G1325]
set_load -pin_load 0.1 [get_ports G1326]
set_load -pin_load 0.1 [get_ports G1327]
set_load -pin_load 0.1 [get_ports G1328]
set_load -pin_load 0.1 [get_ports G1329]
set_load -pin_load 0.1 [get_ports G1330]
set_load -pin_load 0.1 [get_ports G1331]
set_load -pin_load 0.1 [get_ports G1332]
set_load -pin_load 0.1 [get_ports G1333]
set_load -pin_load 0.1 [get_ports G1334]
set_load -pin_load 0.1 [get_ports G1335]
set_load -pin_load 0.1 [get_ports G1336]
set_load -pin_load 0.1 [get_ports G1337]
set_load -pin_load 0.1 [get_ports G1338]
set_load -pin_load 0.1 [get_ports G1339]
set_load -pin_load 0.1 [get_ports G1340]
set_load -pin_load 0.1 [get_ports G1341]
set_load -pin_load 0.1 [get_ports G1342]
set_load -pin_load 0.1 [get_ports G1343]
set_load -pin_load 0.1 [get_ports G1344]
set_load -pin_load 0.1 [get_ports G1345]
set_load -pin_load 0.1 [get_ports G1346]
set_load -pin_load 0.1 [get_ports G1347]
set_load -pin_load 0.1 [get_ports G1348]
set_load -pin_load 0.1 [get_ports G1349]
set_load -pin_load 0.1 [get_ports G1350]
set_load -pin_load 0.1 [get_ports G1351]
set_load -pin_load 0.1 [get_ports G1352]
set_load -pin_load 0.1 [get_ports G1353]
set_load -pin_load 0.1 [get_ports G1354]
set_load -pin_load 0.1 [get_ports G1355]
set_max_fanout 8 [get_ports G1]
set_max_fanout 8 [get_ports G10]
set_max_fanout 8 [get_ports G11]
set_max_fanout 8 [get_ports G12]
set_max_fanout 8 [get_ports G13]
set_max_fanout 8 [get_ports G14]
set_max_fanout 8 [get_ports G15]
set_max_fanout 8 [get_ports G16]
set_max_fanout 8 [get_ports G17]
set_max_fanout 8 [get_ports G18]
set_max_fanout 8 [get_ports G19]
set_max_fanout 8 [get_ports G2]
set_max_fanout 8 [get_ports G20]
set_max_fanout 8 [get_ports G21]
set_max_fanout 8 [get_ports G22]
set_max_fanout 8 [get_ports G23]
set_max_fanout 8 [get_ports G24]
set_max_fanout 8 [get_ports G25]
set_max_fanout 8 [get_ports G26]
set_max_fanout 8 [get_ports G27]
set_max_fanout 8 [get_ports G28]
set_max_fanout 8 [get_ports G29]
set_max_fanout 8 [get_ports G3]
set_max_fanout 8 [get_ports G30]
set_max_fanout 8 [get_ports G31]
set_max_fanout 8 [get_ports G32]
set_max_fanout 8 [get_ports G33]
set_max_fanout 8 [get_ports G34]
set_max_fanout 8 [get_ports G35]
set_max_fanout 8 [get_ports G36]
set_max_fanout 8 [get_ports G37]
set_max_fanout 8 [get_ports G38]
set_max_fanout 8 [get_ports G39]
set_max_fanout 8 [get_ports G4]
set_max_fanout 8 [get_ports G40]
set_max_fanout 8 [get_ports G41]
set_max_fanout 8 [get_ports G5]
set_max_fanout 8 [get_ports G6]
set_max_fanout 8 [get_ports G7]
set_max_fanout 8 [get_ports G8]
set_max_fanout 8 [get_ports G9]
create_clock -name clk  -period 8  -waveform {0 4}
set_clock_latency 2  [get_clocks clk]
set_input_delay -clock clk  2  [get_ports G1]
set_input_delay -clock clk  2  [get_ports G10]
set_input_delay -clock clk  2  [get_ports G11]
set_input_delay -clock clk  2  [get_ports G12]
set_input_delay -clock clk  2  [get_ports G13]
set_input_delay -clock clk  2  [get_ports G14]
set_input_delay -clock clk  2  [get_ports G15]
set_input_delay -clock clk  2  [get_ports G16]
set_input_delay -clock clk  2  [get_ports G17]
set_input_delay -clock clk  2  [get_ports G18]
set_input_delay -clock clk  2  [get_ports G19]
set_input_delay -clock clk  2  [get_ports G2]
set_input_delay -clock clk  2  [get_ports G20]
set_input_delay -clock clk  2  [get_ports G21]
set_input_delay -clock clk  2  [get_ports G22]
set_input_delay -clock clk  2  [get_ports G23]
set_input_delay -clock clk  2  [get_ports G24]
set_input_delay -clock clk  2  [get_ports G25]
set_input_delay -clock clk  2  [get_ports G26]
set_input_delay -clock clk  2  [get_ports G27]
set_input_delay -clock clk  2  [get_ports G28]
set_input_delay -clock clk  2  [get_ports G29]
set_input_delay -clock clk  2  [get_ports G3]
set_input_delay -clock clk  2  [get_ports G30]
set_input_delay -clock clk  2  [get_ports G31]
set_input_delay -clock clk  2  [get_ports G32]
set_input_delay -clock clk  2  [get_ports G33]
set_input_delay -clock clk  2  [get_ports G34]
set_input_delay -clock clk  2  [get_ports G35]
set_input_delay -clock clk  2  [get_ports G36]
set_input_delay -clock clk  2  [get_ports G37]
set_input_delay -clock clk  2  [get_ports G38]
set_input_delay -clock clk  2  [get_ports G39]
set_input_delay -clock clk  2  [get_ports G4]
set_input_delay -clock clk  2  [get_ports G40]
set_input_delay -clock clk  2  [get_ports G41]
set_input_delay -clock clk  2  [get_ports G5]
set_input_delay -clock clk  2  [get_ports G6]
set_input_delay -clock clk  2  [get_ports G7]
set_input_delay -clock clk  2  [get_ports G8]
set_input_delay -clock clk  2  [get_ports G9]
set_output_delay -clock clk  2  [get_ports G1324]
set_output_delay -clock clk  2  [get_ports G1325]
set_output_delay -clock clk  2  [get_ports G1326]
set_output_delay -clock clk  2  [get_ports G1327]
set_output_delay -clock clk  2  [get_ports G1328]
set_output_delay -clock clk  2  [get_ports G1329]
set_output_delay -clock clk  2  [get_ports G1330]
set_output_delay -clock clk  2  [get_ports G1331]
set_output_delay -clock clk  2  [get_ports G1332]
set_output_delay -clock clk  2  [get_ports G1333]
set_output_delay -clock clk  2  [get_ports G1334]
set_output_delay -clock clk  2  [get_ports G1335]
set_output_delay -clock clk  2  [get_ports G1336]
set_output_delay -clock clk  2  [get_ports G1337]
set_output_delay -clock clk  2  [get_ports G1338]
set_output_delay -clock clk  2  [get_ports G1339]
set_output_delay -clock clk  2  [get_ports G1340]
set_output_delay -clock clk  2  [get_ports G1341]
set_output_delay -clock clk  2  [get_ports G1342]
set_output_delay -clock clk  2  [get_ports G1343]
set_output_delay -clock clk  2  [get_ports G1344]
set_output_delay -clock clk  2  [get_ports G1345]
set_output_delay -clock clk  2  [get_ports G1346]
set_output_delay -clock clk  2  [get_ports G1347]
set_output_delay -clock clk  2  [get_ports G1348]
set_output_delay -clock clk  2  [get_ports G1349]
set_output_delay -clock clk  2  [get_ports G1350]
set_output_delay -clock clk  2  [get_ports G1351]
set_output_delay -clock clk  2  [get_ports G1352]
set_output_delay -clock clk  2  [get_ports G1353]
set_output_delay -clock clk  2  [get_ports G1354]
set_output_delay -clock clk  2  [get_ports G1355]
