###################################################################

# Created by write_sdc on Sat Jun  7 18:59:23 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current A
set_max_area 0
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3065gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3066gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3067gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3068gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3069gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3070gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3071gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3072gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3073gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3074gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3075gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3076gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3077gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3078gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3079gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3080gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3081gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3082gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3083gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3084gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3085gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3086gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3087gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3088gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3089gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3090gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3091gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3092gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3093gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3094gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3095gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3097gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3098gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3099gat]
set_driving_cell -lib_cell INVD1 -library umcl18u250t2_wc [get_ports n3100gat]
set_fanout_load 2 [get_ports n3104gat]
set_fanout_load 2 [get_ports n3105gat]
set_fanout_load 2 [get_ports n3106gat]
set_fanout_load 2 [get_ports n3107gat]
set_fanout_load 2 [get_ports n3108gat]
set_fanout_load 2 [get_ports n3109gat]
set_fanout_load 2 [get_ports n3110gat]
set_fanout_load 2 [get_ports n3111gat]
set_fanout_load 2 [get_ports n3112gat]
set_fanout_load 2 [get_ports n3113gat]
set_fanout_load 2 [get_ports n3114gat]
set_fanout_load 2 [get_ports n3115gat]
set_fanout_load 2 [get_ports n3116gat]
set_fanout_load 2 [get_ports n3117gat]
set_fanout_load 2 [get_ports n3118gat]
set_fanout_load 2 [get_ports n3119gat]
set_fanout_load 2 [get_ports n3120gat]
set_fanout_load 2 [get_ports n3121gat]
set_fanout_load 2 [get_ports n3122gat]
set_fanout_load 2 [get_ports n3123gat]
set_fanout_load 2 [get_ports n3124gat]
set_fanout_load 2 [get_ports n3125gat]
set_fanout_load 2 [get_ports n3126gat]
set_fanout_load 2 [get_ports n3127gat]
set_fanout_load 2 [get_ports n3128gat]
set_fanout_load 2 [get_ports n3129gat]
set_fanout_load 2 [get_ports n3130gat]
set_fanout_load 2 [get_ports n3131gat]
set_fanout_load 2 [get_ports n3132gat]
set_fanout_load 2 [get_ports n3133gat]
set_fanout_load 2 [get_ports n3134gat]
set_fanout_load 2 [get_ports n3135gat]
set_fanout_load 2 [get_ports n3136gat]
set_fanout_load 2 [get_ports n3137gat]
set_fanout_load 2 [get_ports n3138gat]
set_fanout_load 2 [get_ports n3139gat]
set_fanout_load 2 [get_ports n3140gat]
set_fanout_load 2 [get_ports n3141gat]
set_fanout_load 2 [get_ports n3142gat]
set_fanout_load 2 [get_ports n3143gat]
set_fanout_load 2 [get_ports n3144gat]
set_fanout_load 2 [get_ports n3145gat]
set_fanout_load 2 [get_ports n3146gat]
set_fanout_load 2 [get_ports n3147gat]
set_fanout_load 2 [get_ports n3148gat]
set_fanout_load 2 [get_ports n3149gat]
set_fanout_load 2 [get_ports n3150gat]
set_fanout_load 2 [get_ports n3151gat]
set_fanout_load 2 [get_ports n3152gat]
set_load -pin_load 0.1 [get_ports n3104gat]
set_load -pin_load 0.1 [get_ports n3105gat]
set_load -pin_load 0.1 [get_ports n3106gat]
set_load -pin_load 0.1 [get_ports n3107gat]
set_load -pin_load 0.1 [get_ports n3108gat]
set_load -pin_load 0.1 [get_ports n3109gat]
set_load -pin_load 0.1 [get_ports n3110gat]
set_load -pin_load 0.1 [get_ports n3111gat]
set_load -pin_load 0.1 [get_ports n3112gat]
set_load -pin_load 0.1 [get_ports n3113gat]
set_load -pin_load 0.1 [get_ports n3114gat]
set_load -pin_load 0.1 [get_ports n3115gat]
set_load -pin_load 0.1 [get_ports n3116gat]
set_load -pin_load 0.1 [get_ports n3117gat]
set_load -pin_load 0.1 [get_ports n3118gat]
set_load -pin_load 0.1 [get_ports n3119gat]
set_load -pin_load 0.1 [get_ports n3120gat]
set_load -pin_load 0.1 [get_ports n3121gat]
set_load -pin_load 0.1 [get_ports n3122gat]
set_load -pin_load 0.1 [get_ports n3123gat]
set_load -pin_load 0.1 [get_ports n3124gat]
set_load -pin_load 0.1 [get_ports n3125gat]
set_load -pin_load 0.1 [get_ports n3126gat]
set_load -pin_load 0.1 [get_ports n3127gat]
set_load -pin_load 0.1 [get_ports n3128gat]
set_load -pin_load 0.1 [get_ports n3129gat]
set_load -pin_load 0.1 [get_ports n3130gat]
set_load -pin_load 0.1 [get_ports n3131gat]
set_load -pin_load 0.1 [get_ports n3132gat]
set_load -pin_load 0.1 [get_ports n3133gat]
set_load -pin_load 0.1 [get_ports n3134gat]
set_load -pin_load 0.1 [get_ports n3135gat]
set_load -pin_load 0.1 [get_ports n3136gat]
set_load -pin_load 0.1 [get_ports n3137gat]
set_load -pin_load 0.1 [get_ports n3138gat]
set_load -pin_load 0.1 [get_ports n3139gat]
set_load -pin_load 0.1 [get_ports n3140gat]
set_load -pin_load 0.1 [get_ports n3141gat]
set_load -pin_load 0.1 [get_ports n3142gat]
set_load -pin_load 0.1 [get_ports n3143gat]
set_load -pin_load 0.1 [get_ports n3144gat]
set_load -pin_load 0.1 [get_ports n3145gat]
set_load -pin_load 0.1 [get_ports n3146gat]
set_load -pin_load 0.1 [get_ports n3147gat]
set_load -pin_load 0.1 [get_ports n3148gat]
set_load -pin_load 0.1 [get_ports n3149gat]
set_load -pin_load 0.1 [get_ports n3150gat]
set_load -pin_load 0.1 [get_ports n3151gat]
set_load -pin_load 0.1 [get_ports n3152gat]
set_max_fanout 8 [get_ports CK]
set_max_fanout 8 [get_ports n3065gat]
set_max_fanout 8 [get_ports n3066gat]
set_max_fanout 8 [get_ports n3067gat]
set_max_fanout 8 [get_ports n3068gat]
set_max_fanout 8 [get_ports n3069gat]
set_max_fanout 8 [get_ports n3070gat]
set_max_fanout 8 [get_ports n3071gat]
set_max_fanout 8 [get_ports n3072gat]
set_max_fanout 8 [get_ports n3073gat]
set_max_fanout 8 [get_ports n3074gat]
set_max_fanout 8 [get_ports n3075gat]
set_max_fanout 8 [get_ports n3076gat]
set_max_fanout 8 [get_ports n3077gat]
set_max_fanout 8 [get_ports n3078gat]
set_max_fanout 8 [get_ports n3079gat]
set_max_fanout 8 [get_ports n3080gat]
set_max_fanout 8 [get_ports n3081gat]
set_max_fanout 8 [get_ports n3082gat]
set_max_fanout 8 [get_ports n3083gat]
set_max_fanout 8 [get_ports n3084gat]
set_max_fanout 8 [get_ports n3085gat]
set_max_fanout 8 [get_ports n3086gat]
set_max_fanout 8 [get_ports n3087gat]
set_max_fanout 8 [get_ports n3088gat]
set_max_fanout 8 [get_ports n3089gat]
set_max_fanout 8 [get_ports n3090gat]
set_max_fanout 8 [get_ports n3091gat]
set_max_fanout 8 [get_ports n3092gat]
set_max_fanout 8 [get_ports n3093gat]
set_max_fanout 8 [get_ports n3094gat]
set_max_fanout 8 [get_ports n3095gat]
set_max_fanout 8 [get_ports n3097gat]
set_max_fanout 8 [get_ports n3098gat]
set_max_fanout 8 [get_ports n3099gat]
set_max_fanout 8 [get_ports n3100gat]
create_clock [get_ports CK]  -period 6  -waveform {0 3}
set_clock_latency 2  [get_clocks CK]
set_input_delay -clock CK  2  [get_ports n3065gat]
set_input_delay -clock CK  2  [get_ports n3066gat]
set_input_delay -clock CK  2  [get_ports n3067gat]
set_input_delay -clock CK  2  [get_ports n3068gat]
set_input_delay -clock CK  2  [get_ports n3069gat]
set_input_delay -clock CK  2  [get_ports n3070gat]
set_input_delay -clock CK  2  [get_ports n3071gat]
set_input_delay -clock CK  2  [get_ports n3072gat]
set_input_delay -clock CK  2  [get_ports n3073gat]
set_input_delay -clock CK  2  [get_ports n3074gat]
set_input_delay -clock CK  2  [get_ports n3075gat]
set_input_delay -clock CK  2  [get_ports n3076gat]
set_input_delay -clock CK  2  [get_ports n3077gat]
set_input_delay -clock CK  2  [get_ports n3078gat]
set_input_delay -clock CK  2  [get_ports n3079gat]
set_input_delay -clock CK  2  [get_ports n3080gat]
set_input_delay -clock CK  2  [get_ports n3081gat]
set_input_delay -clock CK  2  [get_ports n3082gat]
set_input_delay -clock CK  2  [get_ports n3083gat]
set_input_delay -clock CK  2  [get_ports n3084gat]
set_input_delay -clock CK  2  [get_ports n3085gat]
set_input_delay -clock CK  2  [get_ports n3086gat]
set_input_delay -clock CK  2  [get_ports n3087gat]
set_input_delay -clock CK  2  [get_ports n3088gat]
set_input_delay -clock CK  2  [get_ports n3089gat]
set_input_delay -clock CK  2  [get_ports n3090gat]
set_input_delay -clock CK  2  [get_ports n3091gat]
set_input_delay -clock CK  2  [get_ports n3092gat]
set_input_delay -clock CK  2  [get_ports n3093gat]
set_input_delay -clock CK  2  [get_ports n3094gat]
set_input_delay -clock CK  2  [get_ports n3095gat]
set_input_delay -clock CK  2  [get_ports n3097gat]
set_input_delay -clock CK  2  [get_ports n3098gat]
set_input_delay -clock CK  2  [get_ports n3099gat]
set_input_delay -clock CK  2  [get_ports n3100gat]
set_output_delay -clock CK  2  [get_ports n3104gat]
set_output_delay -clock CK  2  [get_ports n3105gat]
set_output_delay -clock CK  2  [get_ports n3106gat]
set_output_delay -clock CK  2  [get_ports n3107gat]
set_output_delay -clock CK  2  [get_ports n3108gat]
set_output_delay -clock CK  2  [get_ports n3109gat]
set_output_delay -clock CK  2  [get_ports n3110gat]
set_output_delay -clock CK  2  [get_ports n3111gat]
set_output_delay -clock CK  2  [get_ports n3112gat]
set_output_delay -clock CK  2  [get_ports n3113gat]
set_output_delay -clock CK  2  [get_ports n3114gat]
set_output_delay -clock CK  2  [get_ports n3115gat]
set_output_delay -clock CK  2  [get_ports n3116gat]
set_output_delay -clock CK  2  [get_ports n3117gat]
set_output_delay -clock CK  2  [get_ports n3118gat]
set_output_delay -clock CK  2  [get_ports n3119gat]
set_output_delay -clock CK  2  [get_ports n3120gat]
set_output_delay -clock CK  2  [get_ports n3121gat]
set_output_delay -clock CK  2  [get_ports n3122gat]
set_output_delay -clock CK  2  [get_ports n3123gat]
set_output_delay -clock CK  2  [get_ports n3124gat]
set_output_delay -clock CK  2  [get_ports n3125gat]
set_output_delay -clock CK  2  [get_ports n3126gat]
set_output_delay -clock CK  2  [get_ports n3127gat]
set_output_delay -clock CK  2  [get_ports n3128gat]
set_output_delay -clock CK  2  [get_ports n3129gat]
set_output_delay -clock CK  2  [get_ports n3130gat]
set_output_delay -clock CK  2  [get_ports n3131gat]
set_output_delay -clock CK  2  [get_ports n3132gat]
set_output_delay -clock CK  2  [get_ports n3133gat]
set_output_delay -clock CK  2  [get_ports n3134gat]
set_output_delay -clock CK  2  [get_ports n3135gat]
set_output_delay -clock CK  2  [get_ports n3136gat]
set_output_delay -clock CK  2  [get_ports n3137gat]
set_output_delay -clock CK  2  [get_ports n3138gat]
set_output_delay -clock CK  2  [get_ports n3139gat]
set_output_delay -clock CK  2  [get_ports n3140gat]
set_output_delay -clock CK  2  [get_ports n3141gat]
set_output_delay -clock CK  2  [get_ports n3142gat]
set_output_delay -clock CK  2  [get_ports n3143gat]
set_output_delay -clock CK  2  [get_ports n3144gat]
set_output_delay -clock CK  2  [get_ports n3145gat]
set_output_delay -clock CK  2  [get_ports n3146gat]
set_output_delay -clock CK  2  [get_ports n3147gat]
set_output_delay -clock CK  2  [get_ports n3148gat]
set_output_delay -clock CK  2  [get_ports n3149gat]
set_output_delay -clock CK  2  [get_ports n3150gat]
set_output_delay -clock CK  2  [get_ports n3151gat]
set_output_delay -clock CK  2  [get_ports n3152gat]
